-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2015-12-12 09:10:09
-- 服务器版本： 10.1.9-MariaDB
-- PHP Version: 5.6.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `yii2beginners`
--

-- --------------------------------------------------------

--
-- 表的结构 `gender`
--

CREATE TABLE `gender` (
  `id` smallint(6) UNSIGNED NOT NULL,
  `gender_name` varchar(45) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `gender`
--

INSERT INTO `gender` (`id`, `gender_name`) VALUES
(1, 'male'),
(2, 'female');

-- --------------------------------------------------------

--
-- 表的结构 `kjh`
--

CREATE TABLE `kjh` (
  `qh` int(11) NOT NULL,
  `n1` int(11) NOT NULL,
  `n2` int(11) NOT NULL,
  `n3` int(11) NOT NULL,
  `n4` int(11) NOT NULL,
  `n5` int(11) NOT NULL,
  `n6` int(11) NOT NULL,
  `n7` int(11) NOT NULL,
  `n8` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `kjh`
--

INSERT INTO `kjh` (`qh`, `n1`, `n2`, `n3`, `n4`, `n5`, `n6`, `n7`, `n8`) VALUES
(2014100, 2, 9, 11, 19, 20, 24, 25, 26),
(2014101, 3, 5, 9, 14, 15, 25, 29, 11),
(2014102, 1, 9, 14, 15, 16, 17, 18, 21),
(2014103, 6, 17, 19, 21, 22, 26, 28, 10),
(2014104, 5, 6, 9, 11, 12, 13, 19, 20),
(2014105, 1, 5, 11, 12, 20, 21, 22, 25),
(2014106, 12, 15, 16, 20, 22, 29, 30, 27),
(2014107, 3, 5, 7, 9, 15, 18, 25, 29),
(2014108, 1, 8, 13, 20, 25, 28, 29, 3),
(2014109, 1, 3, 8, 9, 15, 23, 28, 25),
(2014110, 4, 5, 11, 13, 18, 21, 23, 10),
(2014111, 3, 5, 8, 16, 21, 29, 30, 22),
(2014112, 2, 4, 8, 12, 15, 18, 27, 3),
(2014113, 8, 9, 11, 13, 17, 23, 29, 24),
(2014114, 2, 11, 16, 17, 21, 23, 29, 3),
(2014115, 6, 18, 19, 20, 25, 26, 27, 11),
(2014116, 1, 6, 8, 10, 19, 21, 27, 14),
(2014117, 5, 9, 11, 12, 14, 19, 28, 22),
(2014118, 7, 15, 18, 21, 25, 29, 30, 12),
(2014119, 1, 6, 7, 10, 15, 16, 20, 9),
(2014120, 2, 5, 16, 17, 19, 21, 25, 29),
(2014121, 2, 8, 10, 21, 22, 27, 29, 12),
(2014122, 1, 4, 6, 12, 17, 27, 29, 16),
(2014123, 6, 10, 11, 19, 23, 24, 28, 14),
(2014124, 1, 14, 21, 23, 24, 26, 28, 5),
(2014125, 1, 9, 20, 21, 22, 23, 29, 15),
(2014126, 2, 10, 11, 18, 19, 21, 25, 26),
(2014127, 5, 7, 10, 18, 19, 21, 27, 28),
(2014128, 2, 3, 8, 10, 24, 27, 28, 1),
(2014129, 2, 4, 6, 8, 9, 10, 11, 21),
(2014130, 3, 6, 10, 15, 17, 19, 25, 29),
(2014131, 6, 8, 10, 22, 23, 24, 26, 21),
(2014132, 3, 4, 6, 9, 12, 22, 30, 25),
(2014133, 3, 4, 9, 10, 12, 16, 22, 11),
(2014134, 5, 12, 18, 20, 21, 23, 30, 1),
(2014135, 5, 11, 16, 19, 20, 22, 23, 6),
(2014136, 2, 14, 16, 19, 25, 27, 29, 7),
(2014137, 2, 4, 5, 6, 7, 11, 12, 19),
(2014138, 6, 8, 15, 17, 18, 21, 22, 20),
(2014139, 2, 5, 10, 21, 23, 24, 25, 4),
(2014140, 10, 12, 19, 21, 24, 26, 28, 23),
(2014141, 4, 5, 12, 19, 22, 24, 29, 15),
(2014142, 7, 12, 19, 20, 21, 24, 26, 18),
(2014143, 12, 16, 17, 19, 20, 25, 29, 1),
(2014144, 3, 9, 10, 16, 25, 27, 30, 21),
(2014145, 4, 9, 17, 26, 27, 28, 29, 14),
(2014146, 6, 8, 10, 15, 23, 28, 29, 24),
(2014147, 5, 9, 10, 15, 27, 28, 30, 21),
(2014148, 3, 7, 12, 14, 16, 22, 24, 21),
(2014149, 3, 15, 18, 20, 24, 27, 30, 25),
(2014150, 5, 7, 9, 10, 13, 14, 20, 27),
(2014151, 3, 4, 16, 17, 24, 25, 30, 1),
(2014152, 1, 4, 8, 11, 25, 27, 29, 20),
(2014153, 6, 7, 9, 17, 18, 20, 29, 15),
(2014154, 3, 8, 9, 19, 22, 26, 28, 15),
(2015001, 9, 12, 18, 20, 21, 22, 27, 6),
(2015002, 2, 3, 10, 18, 25, 27, 30, 24),
(2015003, 6, 7, 11, 13, 17, 19, 30, 20),
(2015004, 8, 10, 12, 13, 18, 22, 24, 20),
(2015005, 8, 14, 18, 23, 25, 28, 29, 3),
(2015006, 7, 10, 13, 18, 21, 27, 28, 5),
(2015007, 3, 4, 5, 11, 16, 18, 23, 17),
(2015008, 3, 4, 6, 11, 17, 23, 25, 28),
(2015009, 2, 6, 7, 11, 19, 23, 30, 4),
(2015010, 5, 9, 15, 21, 26, 27, 30, 17),
(2015011, 1, 3, 4, 9, 14, 19, 25, 6),
(2015012, 2, 5, 6, 11, 16, 18, 23, 12),
(2015013, 5, 15, 20, 21, 22, 24, 25, 28),
(2015014, 1, 11, 16, 23, 26, 27, 30, 19),
(2015015, 6, 8, 11, 20, 22, 25, 27, 30),
(2015016, 3, 8, 9, 14, 27, 29, 30, 24),
(2015017, 2, 4, 11, 19, 21, 23, 26, 30),
(2015018, 2, 4, 8, 12, 15, 19, 28, 14),
(2015019, 4, 7, 11, 13, 24, 26, 29, 8),
(2015020, 3, 6, 7, 11, 25, 29, 30, 17),
(2015021, 7, 9, 10, 11, 13, 22, 23, 16),
(2015022, 7, 12, 14, 17, 18, 23, 26, 5),
(2015023, 3, 5, 10, 17, 20, 23, 25, 19),
(2015024, 8, 10, 19, 23, 24, 26, 29, 12),
(2015025, 3, 9, 10, 15, 17, 21, 24, 18),
(2015026, 9, 12, 13, 15, 20, 22, 23, 29),
(2015027, 2, 3, 5, 12, 18, 19, 27, 21),
(2015028, 6, 19, 21, 22, 23, 27, 29, 5),
(2015029, 4, 9, 12, 14, 19, 20, 22, 3),
(2015030, 3, 5, 14, 15, 23, 24, 27, 11),
(2015031, 1, 9, 15, 24, 25, 26, 30, 6),
(2015032, 2, 3, 4, 6, 10, 19, 27, 8),
(2015033, 3, 12, 13, 15, 18, 21, 26, 9),
(2015034, 8, 14, 16, 17, 27, 28, 30, 29),
(2015035, 4, 5, 7, 8, 10, 22, 26, 29),
(2015036, 5, 6, 11, 13, 22, 28, 30, 7),
(2015037, 9, 13, 16, 19, 25, 26, 29, 20),
(2015038, 3, 10, 14, 22, 23, 24, 27, 17),
(2015039, 4, 5, 17, 20, 22, 23, 27, 14),
(2015040, 1, 2, 8, 13, 16, 17, 26, 27),
(2015041, 2, 4, 9, 12, 13, 14, 30, 23),
(2015042, 2, 7, 14, 16, 17, 20, 22, 18),
(2015043, 1, 2, 6, 13, 14, 15, 21, 12),
(2015044, 2, 6, 10, 18, 19, 26, 29, 16),
(2015045, 12, 14, 18, 21, 22, 28, 29, 30),
(2015046, 1, 4, 13, 17, 19, 21, 23, 14),
(2015047, 3, 7, 10, 11, 15, 24, 30, 6),
(2015048, 1, 2, 10, 12, 20, 22, 29, 14),
(2015049, 5, 10, 13, 15, 16, 25, 26, 28),
(2015050, 4, 7, 9, 17, 26, 29, 30, 27),
(2015051, 2, 10, 11, 13, 22, 24, 27, 19),
(2015052, 2, 4, 5, 13, 19, 21, 27, 9),
(2015053, 4, 7, 9, 14, 18, 21, 28, 13),
(2015054, 1, 7, 9, 10, 12, 23, 25, 18),
(2015055, 2, 3, 5, 17, 21, 25, 26, 9),
(2015056, 5, 8, 19, 24, 26, 28, 30, 25),
(2015057, 4, 8, 10, 15, 20, 22, 27, 28),
(2015058, 7, 8, 12, 21, 26, 29, 30, 9),
(2015059, 2, 4, 6, 20, 26, 29, 30, 3),
(2015060, 3, 4, 14, 16, 24, 27, 29, 25),
(2015061, 4, 6, 7, 16, 18, 23, 25, 15),
(2015062, 3, 8, 9, 11, 15, 19, 30, 12),
(2015063, 2, 5, 11, 12, 15, 17, 24, 3),
(2015064, 2, 8, 15, 18, 25, 27, 30, 21),
(2015065, 2, 4, 5, 6, 15, 19, 24, 9),
(2015066, 1, 6, 7, 9, 15, 16, 28, 12),
(2015067, 3, 5, 12, 20, 21, 26, 28, 29),
(2015068, 1, 4, 5, 10, 15, 19, 30, 28),
(2015069, 3, 7, 13, 15, 17, 28, 30, 8),
(2015070, 1, 2, 5, 10, 15, 25, 28, 27),
(2015071, 1, 2, 13, 20, 21, 23, 29, 12),
(2015072, 4, 10, 12, 13, 23, 26, 27, 30),
(2015073, 6, 7, 13, 20, 24, 25, 30, 3),
(2015074, 1, 8, 9, 16, 18, 21, 28, 26),
(2015075, 4, 12, 13, 18, 19, 20, 30, 22),
(2015076, 3, 10, 14, 19, 20, 23, 28, 25),
(2015077, 3, 6, 7, 9, 17, 20, 28, 29),
(2015078, 1, 9, 14, 16, 17, 19, 28, 13),
(2015079, 4, 9, 16, 18, 20, 21, 26, 1),
(2015080, 1, 11, 14, 16, 26, 27, 30, 9),
(2015081, 6, 11, 13, 18, 25, 27, 28, 21),
(2015082, 3, 5, 7, 14, 17, 23, 30, 13),
(2015083, 7, 10, 12, 19, 24, 25, 28, 26),
(2015084, 2, 8, 15, 17, 22, 27, 30, 28),
(2015085, 1, 3, 4, 11, 13, 16, 21, 28),
(2015086, 4, 5, 6, 8, 16, 19, 25, 28),
(2015087, 3, 4, 9, 16, 24, 26, 30, 21),
(2015088, 1, 8, 14, 15, 18, 19, 22, 26),
(2015089, 3, 22, 23, 24, 27, 28, 30, 19),
(2015090, 6, 13, 17, 18, 23, 24, 27, 12),
(2015091, 8, 10, 15, 16, 17, 22, 24, 7),
(2015092, 3, 5, 6, 15, 16, 17, 30, 8),
(2015093, 3, 7, 9, 14, 15, 19, 24, 25),
(2015094, 1, 4, 6, 16, 19, 23, 26, 22),
(2015095, 1, 2, 10, 13, 21, 26, 27, 9),
(2015096, 1, 7, 11, 12, 17, 19, 25, 13),
(2015097, 2, 4, 14, 16, 18, 27, 28, 9),
(2015098, 3, 5, 11, 20, 22, 23, 24, 28),
(2015099, 1, 3, 8, 9, 18, 23, 24, 17),
(2015100, 3, 6, 7, 12, 19, 22, 29, 18),
(2015101, 7, 12, 16, 18, 22, 23, 29, 6),
(2015102, 2, 5, 8, 10, 18, 26, 27, 4),
(2015103, 3, 6, 20, 22, 26, 27, 29, 2),
(2015104, 4, 5, 12, 16, 20, 23, 24, 1),
(2015105, 8, 14, 15, 20, 21, 23, 27, 28),
(2015106, 1, 2, 14, 17, 20, 23, 29, 28),
(2015107, 3, 6, 7, 10, 13, 24, 25, 1),
(2015108, 6, 7, 8, 12, 22, 24, 29, 25),
(2015109, 1, 6, 13, 17, 18, 21, 27, 16),
(2015110, 2, 4, 5, 6, 8, 11, 12, 7),
(2015111, 6, 8, 11, 13, 15, 19, 26, 3),
(2015112, 4, 5, 10, 22, 23, 28, 29, 2),
(2015113, 5, 12, 14, 19, 21, 28, 29, 23),
(2015114, 3, 4, 8, 16, 20, 28, 29, 21),
(2015115, 11, 16, 17, 18, 20, 26, 29, 4),
(2015116, 4, 5, 8, 15, 17, 20, 24, 3),
(2015117, 1, 11, 13, 16, 19, 23, 25, 22),
(2015118, 2, 3, 7, 15, 24, 27, 29, 1),
(2015119, 5, 10, 13, 22, 26, 28, 30, 14),
(2015120, 2, 4, 6, 14, 17, 23, 30, 24),
(2015121, 11, 21, 23, 24, 25, 26, 29, 28),
(2015122, 1, 8, 9, 13, 14, 24, 29, 7),
(2015123, 6, 23, 24, 25, 26, 28, 30, 18),
(2015124, 4, 5, 6, 13, 20, 23, 27, 12),
(2015125, 2, 3, 15, 20, 21, 25, 27, 24),
(2015126, 6, 8, 11, 18, 21, 27, 29, 26),
(2015127, 2, 10, 11, 14, 18, 20, 22, 26),
(2015128, 3, 13, 14, 20, 25, 28, 29, 8),
(2015129, 1, 6, 7, 9, 14, 15, 22, 23),
(2015130, 4, 5, 9, 12, 13, 18, 24, 29),
(2015131, 1, 5, 8, 11, 20, 23, 30, 3),
(2015132, 1, 2, 6, 7, 18, 19, 30, 8),
(2015133, 3, 4, 8, 9, 12, 19, 28, 18),
(2015134, 11, 15, 19, 20, 25, 27, 29, 8),
(2015135, 1, 13, 20, 23, 24, 27, 29, 15),
(2015136, 5, 6, 11, 14, 22, 23, 25, 4),
(2015137, 2, 4, 9, 12, 15, 17, 18, 6),
(2015138, 1, 7, 15, 22, 25, 26, 27, 23),
(2015139, 1, 4, 6, 17, 20, 25, 30, 3),
(2015140, 5, 6, 7, 15, 21, 26, 28, 29),
(2015141, 5, 7, 8, 20, 23, 24, 27, 3),
(2015142, 1, 7, 8, 9, 18, 19, 25, 15),
(2015143, 1, 5, 9, 15, 16, 25, 26, 21),
(2015144, 1, 4, 6, 8, 15, 18, 23, 13),
(2015145, 4, 6, 12, 16, 17, 19, 25, 22);

-- --------------------------------------------------------

--
-- 表的结构 `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1448338502),
('m130524_201442_init', 1448338505),
('m151106_175443_create_kjh_table', 1449843113),
('m151114_071002_update_user_table', 1448338509),
('m151115_031453_create_role_table', 1448338510),
('m151115_041529_create_status_table', 1448338510),
('m151115_042626_create_gender_table', 1448338511),
('m151115_043228_create_profile_table', 1448338514),
('m151116_125929_create_user_type_table', 1448338514);

-- --------------------------------------------------------

--
-- 表的结构 `profile`
--

CREATE TABLE `profile` (
  `id` int(11) UNSIGNED NOT NULL,
  `user_id` int(11) UNSIGNED NOT NULL,
  `first_name` text,
  `last_name` text,
  `birthdate` date DEFAULT NULL,
  `gender_id` smallint(6) UNSIGNED NOT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 表的结构 `role`
--

CREATE TABLE `role` (
  `id` smallint(6) NOT NULL,
  `role_name` varchar(45) NOT NULL,
  `role_value` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `role`
--

INSERT INTO `role` (`id`, `role_name`, `role_value`) VALUES
(1, 'User', 10),
(2, 'Admin', 20),
(3, 'SuperUser', 30);

-- --------------------------------------------------------

--
-- 表的结构 `status`
--

CREATE TABLE `status` (
  `id` smallint(6) NOT NULL,
  `status_name` varchar(45) NOT NULL,
  `status_value` smallint(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `status`
--

INSERT INTO `status` (`id`, `status_name`, `status_value`) VALUES
(1, 'Active', 10),
(2, 'Pending', 5);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(11) UNSIGNED NOT NULL,
  `username` varchar(255) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `password_reset_token` varchar(255) DEFAULT NULL,
  `email` varchar(255) NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL,
  `user_type_id` smallint(6) NOT NULL DEFAULT '1',
  `role_id` smallint(6) NOT NULL DEFAULT '1',
  `status_id` smallint(6) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `created_at`, `updated_at`, `user_type_id`, `role_id`, `status_id`) VALUES
(2, 'samksan', 'Fu4j6PqGi109ilQnIaa7JRCp4vT_RLmM', '$2y$13$FfrF76LDGcV0dJi8SDOzrOoTz5S7cZM0nbL0zZM7H57N8LWpp/jzS', NULL, 'samksan@163.com', '2015-12-05 18:29:55', '2015-12-05 18:29:55', 2, 3, 1);

-- --------------------------------------------------------

--
-- 表的结构 `user_type`
--

CREATE TABLE `user_type` (
  `id` smallint(6) NOT NULL,
  `user_type_name` varchar(45) NOT NULL,
  `user_type_value` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_type`
--

INSERT INTO `user_type` (`id`, `user_type_name`, `user_type_value`) VALUES
(1, 'Free', 10),
(2, 'Paid', 30);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `gender`
--
ALTER TABLE `gender`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `kjh`
--
ALTER TABLE `kjh`
  ADD PRIMARY KEY (`qh`);

--
-- Indexes for table `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`);

--
-- Indexes for table `profile`
--
ALTER TABLE `profile`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_gender_profile` (`gender_id`);

--
-- Indexes for table `role`
--
ALTER TABLE `role`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `status`
--
ALTER TABLE `status`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `password_reset_token` (`password_reset_token`);

--
-- Indexes for table `user_type`
--
ALTER TABLE `user_type`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `gender`
--
ALTER TABLE `gender`
  MODIFY `id` smallint(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `profile`
--
ALTER TABLE `profile`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `role`
--
ALTER TABLE `role`
  MODIFY `id` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
--
-- 使用表AUTO_INCREMENT `status`
--
ALTER TABLE `status`
  MODIFY `id` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 使用表AUTO_INCREMENT `user_type`
--
ALTER TABLE `user_type`
  MODIFY `id` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
--
-- 限制导出的表
--

--
-- 限制表 `profile`
--
ALTER TABLE `profile`
  ADD CONSTRAINT `fk_gender_profile` FOREIGN KEY (`gender_id`) REFERENCES `gender` (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
